20220829110049-data_warehouse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>data warehouse</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">data warehouse</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc525457">sources</a>
<ul>
<li><a href="#org9cca625">transactional (inferring)</a>
<ul>
<li><a href="#orgc73effb">kvasercan</a></li>
<li><a href="#orgf67bfa0">remotecan</a></li>
</ul>
</li>
<li><a href="#org5d07636">analytical (batch, training)</a>
<ul>
<li><a href="#orgcbb4818">mongodb</a></li>
<li><a href="#orgcaea7e6">elastic</a></li>
<li><a href="#orga1c7758">pystore</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org55d0208">formats</a>
<ul>
<li><a href="#org1d9e41b">pandas dataframe</a></li>
<li><a href="#org612dce2">numpy array</a></li>
<li><a href="#orgca9fe55">apache parquet</a></li>
<li><a href="#orgbaad032">CSV</a></li>
<li><a href="#org4f4fa0d">JSON</a></li>
</ul>
</li>
<li><a href="#org0e1aae3">models</a>
<ul>
<li><a href="#org1a72b9b">NoSQL</a></li>
<li><a href="#orgd5c3896">time sequence</a></li>
<li><a href="#org79c4cd6">document model</a></li>
<li><a href="#orge2573e8">(graph model)</a></li>
<li><a href="#orgbea6d3e">structured data</a></li>
<li><a href="#org3428775">(unstructured data)</a></li>
</ul>
</li>
<li><a href="#org2914738">storage engines and processing</a>
<ul>
<li><a href="#org16ac719">MongoDB time series collection</a></li>
<li><a href="#orga840959">pystore (dask)</a></li>
</ul>
</li>
<li><a href="#orgb67dfbd">modes of data flow</a>
<ul>
<li><a href="#org679069e">passing through database</a></li>
<li><a href="#orgcf23ccf">through through service (HTTP REST),  (RPC)</a></li>
<li><a href="#org4babd1d">through real-time transport (Kafka, )</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       18d7b376-c12a-41a5-977a-966a078925f4
</p>

<div id="outline-container-orgc525457" class="outline-2">
<h2 id="orgc525457">sources</h2>
<div class="outline-text-2" id="text-orgc525457">
</div>
<div id="outline-container-org9cca625" class="outline-3">
<h3 id="org9cca625">transactional (inferring)</h3>
<div class="outline-text-3" id="text-org9cca625">
</div>
<div id="outline-container-orgc73effb" class="outline-4">
<h4 id="orgc73effb">kvasercan</h4>
</div>
<div id="outline-container-orgf67bfa0" class="outline-4">
<h4 id="orgf67bfa0">remotecan</h4>
</div>
</div>
<div id="outline-container-org5d07636" class="outline-3">
<h3 id="org5d07636">analytical (batch, training)</h3>
<div class="outline-text-3" id="text-org5d07636">
</div>
<div id="outline-container-orgcbb4818" class="outline-4">
<h4 id="orgcbb4818">mongodb</h4>
</div>
<div id="outline-container-orgcaea7e6" class="outline-4">
<h4 id="orgcaea7e6">elastic</h4>
</div>
<div id="outline-container-orga1c7758" class="outline-4">
<h4 id="orga1c7758">pystore</h4>
</div>
</div>
</div>
<div id="outline-container-org55d0208" class="outline-2">
<h2 id="org55d0208">formats</h2>
<div class="outline-text-2" id="text-org55d0208">
</div>
<div id="outline-container-org1d9e41b" class="outline-3">
<h3 id="org1d9e41b">pandas dataframe</h3>
</div>
<div id="outline-container-org612dce2" class="outline-3">
<h3 id="org612dce2">numpy array</h3>
</div>
<div id="outline-container-orgca9fe55" class="outline-3">
<h3 id="orgca9fe55">apache parquet</h3>
</div>
<div id="outline-container-orgbaad032" class="outline-3">
<h3 id="orgbaad032">CSV</h3>
</div>
<div id="outline-container-org4f4fa0d" class="outline-3">
<h3 id="org4f4fa0d">JSON</h3>
</div>
</div>
<div id="outline-container-org0e1aae3" class="outline-2">
<h2 id="org0e1aae3">models</h2>
<div class="outline-text-2" id="text-org0e1aae3">
</div>
<div id="outline-container-org1a72b9b" class="outline-3">
<h3 id="org1a72b9b">NoSQL</h3>
</div>
<div id="outline-container-orgd5c3896" class="outline-3">
<h3 id="orgd5c3896">time sequence</h3>
</div>
<div id="outline-container-org79c4cd6" class="outline-3">
<h3 id="org79c4cd6">document model</h3>
</div>
<div id="outline-container-orge2573e8" class="outline-3">
<h3 id="orge2573e8">(graph model)</h3>
</div>
<div id="outline-container-orgbea6d3e" class="outline-3">
<h3 id="orgbea6d3e">structured data</h3>
</div>
<div id="outline-container-org3428775" class="outline-3">
<h3 id="org3428775">(unstructured data)</h3>
</div>
</div>
<div id="outline-container-org2914738" class="outline-2">
<h2 id="org2914738">storage engines and processing</h2>
<div class="outline-text-2" id="text-org2914738">
</div>
<div id="outline-container-org16ac719" class="outline-3">
<h3 id="org16ac719">MongoDB time series collection</h3>
</div>
<div id="outline-container-orga840959" class="outline-3">
<h3 id="orga840959">pystore (dask)</h3>
</div>
</div>
<div id="outline-container-orgb67dfbd" class="outline-2">
<h2 id="orgb67dfbd">modes of data flow</h2>
<div class="outline-text-2" id="text-orgb67dfbd">
</div>
<div id="outline-container-org679069e" class="outline-3">
<h3 id="org679069e">passing through database</h3>
</div>
<div id="outline-container-orgcf23ccf" class="outline-3">
<h3 id="orgcf23ccf">through through service (HTTP REST),  (RPC)</h3>
</div>
<div id="outline-container-org4babd1d" class="outline-3">
<h3 id="org4babd1d">through real-time transport (Kafka, )</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
